{
  "name": "ratchet",
  "version": "1.0.1",
  "main": [
    "./dist/ratchet.js",
    "./dist/ratchet.css"
  ],
  "gitHead": "080105e1e69f9675c490b34e781ea0d3211b4755",
  "readme": "# Ratchet\n\nPrototype mobile apps with simple HTML, CSS and JS components.\n\n## Getting Started\n\n- Clone the repo `git clone git@github.com:maker/ratchet.git` or just [download](http://maker.github.com/ratchet/ratchet.zip) the bundled CSS and JS\n- [Read the docs](http://maker.github.com/ratchet) to learn about the components and how to get a prototype on your phone\n- We will have example apps to check out very soon!\n\nTake note that our master branch is our active, unstable development branch and that if you're looking to download a stable copy of the repo, check the [tagged downloads](https://github.com/maker/ratchet/tags).\n\n## Support\n\nRatchet was developed to support iOS 5+ for iPhone. Questions or discussions about Ratchet should happen in the [Google group](https://groups.google.com/forum/#!forum/goratchet) or hit us up on Twitter [@goRatchet](http://www.twitter.com/goratchet).\n\n## Reporting bugs & contributing\n\nPlease file a Github issue to [report a bug](http://github.com/maker/ratchet/issues). When reporting a bug, be sure to follow the [contributor guidelines](https://github.com/maker/ratchet/blob/master/CONTRIBUTING.md).\n\n## Troubleshooting\n\nA small list of \"gotchas\" are provided below for designers and developers starting to work with Ratchet\n\n- Ratchet is designed to respond to touch events from a mobile device. In order to use mouse click events (for desktop browsing and testing), you have a few options:\n    - Enable touch event emulation in Chrome (found in the overrides tab in the web inspector preferences)\n    - Use a javascript library like fingerblast.js to emulate touch events (ideally only loaded from desktop devices)\n- Script tags containing javascript will not be executed on pages that are loaded with push.js. If you would like to attach event handlers to elements on other pages, document-level event delegation is a common solution.\n- Ratchet uses XHR requests to fetch additional pages inside the application. Due to security concerns, modern browsers prevent XHR requests when opening files locally (aka using the file:/// protocol); consequently, Ratchet does not work when opened directly as a file.\n    - A common solution to this is to simply serve the files from a local server. One convenient way to achieve this is to run ```python -m SimpleHTTPServer <port>``` to serve up the files in the current directory to ```http://localhost:<port>```\n\n## Future features\n\nRatchet is just getting started. Here are some of the immediate features we're thinking about:\n\n- Shelf (exposable left hand navigation a la Path or Facebook)\n- Gridviews\n- Notifications\n- Slide control\n- More list views options\n- Improved active states (especially for lists)\n- Docking list dividers\n- Touch library for richer touch events (swipes, long press, etc)\n- Autocomplete\n- Hiding title bar (hides with scroll)\n\nEven these are just the short-term goals though. We eventually want to extend Ratchet beyond the prototying for iPhone and create HTML/CSS/JS components for iPad and Android devices. Our dream is that Ratchet becomes the best way to create mobile experiences with web standard languages.\n\n## Authors\n\nDave Gamache\n\n- http://twitter.com/dhg\n- http://github.com/dhgamache\n\nConnor Sears\n\n- http://twitter.com/connors\n- http://github.com/connors\n\nJacob Thornton\n\n- http://twitter.com/fat\n- http://github.com/fat\n\n\n## License\n\nRatchet is licensed under the [MIT License](http://opensource.org/licenses/MIT).\n",
  "readmeFilename": "README.md",
  "_id": "ratchet@1.0.0",
  "description": "Prototype mobile apps with simple HTML, CSS and JS components.",
  "repository": {
    "type": "git",
    "url": "git://github.com/maker/ratchet"
  }
}